; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	Star4 - direction
	Star3 - direction
	GroundStation1 - direction
	Star0 - direction
	GroundStation2 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet16)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument6 spectrograph1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star0)
	(supports instrument7 thermograph0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
)
(:goal (and
	(pointing satellite0 Phenomenon17)
	(have_image Star5 spectrograph1)
	(have_image Planet6 spectrograph1)
	(have_image Planet7 thermograph0)
	(have_image Planet8 spectrograph1)
	(have_image Phenomenon9 thermograph0)
	(have_image Star10 thermograph0)
	(have_image Phenomenon11 spectrograph1)
	(have_image Star12 thermograph0)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon14 thermograph0)
	(have_image Star15 thermograph0)
	(have_image Planet16 thermograph0)
	(have_image Phenomenon17 spectrograph1)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 14
2. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 0 of 14
3. (turn_to satellite1 planet16 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet16)
   goals met: 0 of 14
4. (take_image satellite1 planet16 instrument3 thermograph0)
   added: (have_image planet16 thermograph0)
   goals met: 1 of 14
5. (turn_to satellite1 phenomenon9 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 14
6. (take_image satellite1 phenomenon9 instrument3 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 2 of 14
7. (turn_to satellite1 phenomenon17 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon17)
   goals met: 2 of 14
8. (take_image satellite1 phenomenon17 instrument3 spectrograph1)
   added: (have_image phenomenon17 spectrograph1)
   goals met: 3 of 14
9. (turn_to satellite1 phenomenon14 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon14)
   goals met: 3 of 14
10. (take_image satellite1 phenomenon14 instrument3 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 4 of 14
11. (turn_to satellite1 phenomenon13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon13)
   goals met: 4 of 14
12. (take_image satellite1 phenomenon13 instrument3 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 5 of 14
13. (turn_to satellite1 phenomenon11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon11)
   goals met: 5 of 14
14. (take_image satellite1 phenomenon11 instrument3 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 6 of 14
15. (turn_to satellite0 phenomenon17 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 phenomenon17)
   goals met: 7 of 14
16. (turn_to satellite1 planet6 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet6)
   goals met: 7 of 14
17. (take_image satellite1 planet6 instrument3 spectrograph1)
   added: (have_image planet6 spectrograph1)
   goals met: 8 of 14
18. (turn_to satellite1 planet7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet7)
   goals met: 8 of 14
19. (take_image satellite1 planet7 instrument3 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 9 of 14
20. (turn_to satellite1 planet8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet8)
   goals met: 9 of 14
21. (take_image satellite1 planet8 instrument3 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 10 of 14
22. (turn_to satellite1 star10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star10)
   goals met: 10 of 14
23. (take_image satellite1 star10 instrument3 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 11 of 14
24. (turn_to satellite1 star12 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star12)
   goals met: 11 of 14
25. (take_image satellite1 star12 instrument3 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 12 of 14
26. (turn_to satellite1 star15 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star15)
   goals met: 12 of 14
27. (take_image satellite1 star15 instrument3 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 13 of 14
28. (turn_to satellite1 star5 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star5)
   goals met: 13 of 14
29. (take_image satellite1 star5 instrument3 spectrograph1)
   added: (have_image star5 spectrograph1)
   goals met: 14 of 14
